# Introduccion a tablas pivote en pandas

## pivot() : reconstruye una data basada en valores de una columna (no soporta operaciones)
## pivot_table() : crea una tabla pivote al estilo de excel (soporta operaciones)

In [2]:
import pandas as pd

## pivot()

In [8]:
# read and show the dataset
df_gdp = pd.read_csv('gdp.csv',encoding='latin-1')
df_gdp.head()

   unid wbid      country  year        SES      gdppc  yrseduc  popshare
0     4  AFG  Afghanistan  1970   3.474212  709.00000      NaN  0.003097
1     4  AFG  Afghanistan  1920  26.968016  731.75677      NaN  0.003245
2     4  AFG  Afghanistan  1990   1.269530  604.00000      NaN  0.002347
3     4  AFG  Afghanistan  1960  15.763076  739.00000      NaN  0.003039
4     4  AFG  Afghanistan  2000   2.061114  565.00000      NaN  0.003309

In [10]:
# reshape the dataframe with .pivot()
df_gdp.pivot(index='year',columns='country',values='gdppc').head()

country,Afghanistan,Albania,Algeria,Angola,Argentina,Armenia,Australia,Austria,Bahrain,Bangladesh,...,Ukraine,United Arab Emirates,United Kingdom,United States,Uruguay,Venezuela,Vietnam,Yemen,Zambia,Zimbabwe
year,,,,,,,,,,,,,,,,,,,,,
1880,585.46509,522.0000,819.18604,533.66669,1731.5,1041.0000,4285.0,2079.0,811.76746,566.66669,...,1041.0000,811.76746,3477.0,3184.0,2082.0,653.0,556.62793,811.76746,533.66669,533.66669
1890,635.93024,598.0000,923.37207,567.33331,2152.0,1139.0000,4458.0,2443.0,881.53491,587.33331,...,1139.0000,881.53491,4009.0,3392.0,2147.0,737.0,608.25580,881.53491,567.33331,567.33331
1900,686.39532,685.0000,1027.55810,601.00000,2756.0,1237.0000,4013.0,2882.0,951.30231,608.00000,...,1237.0000,951.30231,4492.0,4091.0,2219.0,821.0,659.88373,951.30231,601.00000,601.00000
1910,736.86047,780.0000,1131.74410,628.69232,3822.0,1430.0769,5210.0,3290.0,1021.06980,661.84613,...,1430.0769,1021.06980,4611.0,4964.0,3136.0,886.0,711.51166,1021.06980,628.69232,628.69232
1920,731.75677,861.3125,1201.21620,682.62964,3473.0,1432.9333,4766.0,2412.0,1242.91890,651.89191,...,1432.9333,3833.67580,4548.0,5552.0,2674.0,1173.0,713.94592,1017.21620,682.62964,682.62964

## .pivot_table()

In [20]:
# leer y mostrar el dataset
df_sales = pd.read_excel('supermarket_sales.xlsx')
df_sales.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,2019-01-05,13:08:00,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,2019-03-08,10:29:00,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,2019-03-03,13:23:00,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,2019-01-27,20:33:00,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2019-02-08,10:37:00,Ewallet,604.17,4.761905,30.2085,5.3

In [23]:
# hacer una tabla pivote y sumar valores agrupados
df_sales.pivot_table(index='Gender', 
                     aggfunc="sum",
                     values=['Quantity','Total'])

        Quantity       Total
Gender
Female      2869  167882.925
Male        2641  155083.824

In [25]:
# hacer una tabla pivote que diga cuando mujeres y 
# hombres gastaron y en q categorias
df_sales.pivot_table(index='Gender', 
                     aggfunc="sum",
                     values='Total',
                     columns='Product line')

Product line,Electronic accessories,Fashion accessories,Food and beverages,Health and beauty,Home and lifestyle,Sports and travel
Gender,,,,,,
Female,27102.0225,30437.400,33170.9175,18560.9865,30036.8775,28574.7210
Male,27235.5090,23868.495,22973.9265,30632.7525,23825.0355,26548.1055